In [2]:
import pandas as pd
import numpy as np
import os
import re
# import tabula

In [1]:
# install pdf to csv
pip install git+https://github.com/pdftables/python-pdftables-api.git
# see https://www.geeksforgeeks.org/convert-pdf-to-csv-using-python/ for reference

SyntaxError: invalid syntax (2561552589.py, line 2)

keep track with the example below

In [3]:
path = '../../1_rawdata/Vehicles_2022/Town files -- need additional treating/'
sav_path = '../../1_rawdata/Vehicles_2022/Town files/'

In [4]:
os.listdir(path)

['131_Southington_MV_21.xlsx']

# 2022.10.14 -- Guilford_MV_21.csv

In [49]:
os.listdir(path)

['Bridgewater_MV_21.pdf',
 'Guilford_MV_21.csv',
 'Meriden_MV_21.pdf',
 'Salem_MV_21.xls']

In [62]:
f = 'Guilford_MV_21.csv'

In [63]:
df = pd.read_csv(path + f)

In [64]:
df.TAXPAYER = df.TAXPAYER.str.strip()
df.STREET = df.STREET.str.strip()
df.CITY = df.CITY.str.strip()
df.STATE = df.STATE.str.strip()
df.VEHICLE_MAKE = df.VEHICLE_MAKE.str.strip()
df.VEHICLE_MODEL = df.VEHICLE_MODEL.str.strip()
df.VEHICLE_ID = df.VEHICLE_ID.str.strip()

df.ZIP1 = df.ZIP1.astype(str).str.zfill(5)
df.ZIP1 = df.ZIP1.replace('     ','')

In [65]:
df.loc[0,'TAXPAYER']

'A & A EXCAVATING LLC'

In [67]:
df.to_csv(sav_path + f)

# 2022.11.6 -- Meriden_MV_21.xlsx

## begin

In [5]:
os.listdir(path)

['Bridgewater_MV_21.pdf', 'Meriden_MV_21.xlsx']

In [6]:
f = 'Meriden_MV_21.xlsx'

In [7]:
df = pd.read_excel(path + f)
df_copy = df.copy()

In [8]:
df.head()

,V1,V2,V3,V4,V5,V6,V1.1,V2.1,V3.1,V4.1,V5.1,V2.2,V3.2,V4.2,V5.2,V6.1
0,50001,119 EMPIRE AVENUE LLC,5003 7100,"31,480",NaN,NaN,NaN,119 EMPIRE AVE,3GCUYDED8KG101637,PICKUP,NaN,MERIDEN CT 06450-1928,CHEVR SILVERAD 2019 03,GRA,"31,480",NaN
1,50002,480-492 CHAMBERLAIN HIGHWAY LLC,3300 5000,500,NaN,NaN,NaN,1400 OLD NORTH COLONY RD,98RC419975,PICKUP,NaN,MERIDEN CT 06450-1960,FORD NONE,1950 25,BLA,500
2,50003,A & F TRUCKING LLC,18900 80000,"43,200",NaN,NaN,NaN,622 HANOVER RD,1XPHD49X4CD167519,TT,NaN,MERIDEN CT 06451-5311,PTRB CONVENTI 2012 02,WHT,"43,200",NaN
3,50004,A & F TRUCKING LLC,16000 80000,"50,750",NaN,NaN,NaN,622 HANOVER RD,1XPHD49X9DD191803,TT,NaN,MERIDEN CT 06451-5311,PTRB CONVENTI 2013 02,RED,"50,750",NaN
4,50005,A & F TRUCKING LLC,18000 80000,"6,390",NaN,NaN,NaN,622 HANOVER RD,1FUYDPYB6RP547101,TRUCK,NaN,MERIDEN CT 06451-5311,FRHT CONV,1994 02,GRN,"6,390"

### check specific columns

In [9]:
np.unique([len(str(i)) for i in df['V5.2']])

array([ 3,  4,  5,  6,  7, 15, 16])

In [10]:
# if keep V5.2
df['V52L'] = df['V5.2'].astype(str).map(len)
df['V52L'].unique()

array([ 6,  3,  5,  7,  4, 16, 15], dtype=int64)

In [11]:
df[df.V52L == 16]['V5.2'].unique()

array(['SIERRA K 2005 01', 'FORTE EX 2014 01', '328IC AU 1997 01',
       'RAM PROM 2015 03'], dtype=object)

In [12]:
# if keep V6.1
df['V61L'] = df['V6.1'].astype(str).map(len)
df['V61L'].unique()

array([ 3,  5,  6, 33, 32,  2, 23, 20, 34, 31, 22,  7, 44, 18, 19, 17, 21],
      dtype=int64)

In [13]:
df[df.V61L == 21]['V6.1'].unique()

array(['1000 C            470'], dtype=object)

## keep only targeted columns

In [14]:
# keep only interested columns
df = df[['V1', 'V2', 'V2.1', 'V3.1', 'V2.2', 'V3.2', 'V4.2', 'V5.2']]

always matched:
V1 -> UID, V2 -> Name, V2.1 -> Street, V3.1 -> VIN

### check V2.2
    three rows have error: UID = 59270, 64442, and 83884
    manually add later

In [15]:
df['l'] = df['V2.2'].astype(str).map(len)
df.l.unique()

array([21, 17, 24, 23, 10, 25, 22, 20, 27, 19, 26, 15, 18, 16, 28,  5, 13,
        6, 12, 30,  9], dtype=int64)

In [16]:
df[df.l < 10]

,V1,V2,V2.1,V3.1,V2.2,V3.2,V4.2,V5.2,l
9269,59270,CYR RICHARD J,76 BUTLER ST A1004,KMHDU46D98U407290,220 F,NaN,NaN,NaN,5
14441,64442,GARDNER ELLIOTT,113 EVERGREEN LANE,1FTRX14829FA86382,1000 E,NaN,NaN,NaN,6
33883,83884,RICHARDS MARYANNE L,360 BROAD ST APT C7,3N1AB7APXEL626350,1000 E,NaN,NaN,NaN,6
44825,94826,YANKEE GAS,107 SELDEN ST,3C6TRVAG8FE505450,BERLIN CT,-,RAM,RAM PROM 2015 03,9
44826,94827,YANKEE GAS,107 SELDEN ST,3C6TRVAGXFE505451,BERLIN CT,-,RAM,RAM PROM 2015 03,9

In [17]:
df_copy[df_copy.V1 == 83884]

,V1,V2,V3,V4,V5,V6,V1.1,V2.1,V3.1,V4.1,V5.1,V2.2,V3.2,V4.2,V5.2,V6.1
33883,83884,RICHARDS MARYANNE L,2900,"5,250",NaN,NaN,NaN,360 BROAD ST APT C7,3N1AB7APXEL626350,SEDAN,2000 A,1000 E,NaN,NaN,NaN,NaN

In [18]:
df = df.drop(columns=['l'])

## rename & harmonize

In [19]:
# rename columns
df = df.rename(columns={'V1': 'UID', 'V2': 'Name', 'V2.1': 'Street', 'V3.1': 'VIN', 'V2.2': 'City & Zip'})

In [20]:
def extract_zip(s):
    if s.find('-') == -1:
        return np.nan
    else:
        return s[s.find('-') - 5: s.find('-')]

def extract_state(s):
    if s.find('-') == -1:
        return s[-2:]
    else:
       return s[s.find('-') - 8: s.find('-') - 6]

def extract_city(s):
    if s.find('-') == -1:
        return s[:-3]
    else:
       return s[:s.find('-') - 9]


df['Zip'] = df['City & Zip'].astype(str).map(extract_zip)
df['State'] = df['City & Zip'].astype(str).map(extract_state)
df['City'] = df['City & Zip'].astype(str).map(extract_city)

In [21]:
df.head()

,UID,Name,Street,VIN,City & Zip,V3.2,V4.2,V5.2,Zip,State,City
0,50001,119 EMPIRE AVENUE LLC,119 EMPIRE AVE,3GCUYDED8KG101637,MERIDEN CT 06450-1928,CHEVR SILVERAD 2019 03,GRA,"31,480",06450,CT,MERIDEN
1,50002,480-492 CHAMBERLAIN HIGHWAY LLC,1400 OLD NORTH COLONY RD,98RC419975,MERIDEN CT 06450-1960,FORD NONE,1950 25,BLA,06450,CT,MERIDEN
2,50003,A & F TRUCKING LLC,622 HANOVER RD,1XPHD49X4CD167519,MERIDEN CT 06451-5311,PTRB CONVENTI 2012 02,WHT,"43,200",06451,CT,MERIDEN
3,50004,A & F TRUCKING LLC,622 HANOVER RD,1XPHD49X9DD191803,MERIDEN CT 06451-5311,PTRB CONVENTI 2013 02,RED,"50,750",06451,CT,MERIDEN
4,50005,A & F TRUCKING LLC,622 HANOVER RD,1FUYDPYB6RP547101,MERIDEN CT 06451-5311,FRHT CONV,1994 02,GRN,06451,CT,MERIDEN

In [22]:
# append the third row together first, then extract
df['Make, Model, and More'] = df['V3.2'] + ' ' + df['V4.2'] + ' ' + df['V5.2']
df = df.drop(columns=['V3.2', 'V4.2', 'V5.2'])

In [23]:
def extract_year(s):
    match = re.search(r'.*([1-2][0129][0-9]{2})', s)
    if match != None:
        return match.group(1)
    else:
        return ''

def extract_make(s):
    return (s[:s.find(' ')])

def extract_model(s):
    return s[s.find(' ')+1 : s.find(extract_year(s))-1]

df['Year'] = df['Make, Model, and More'].astype(str).map(extract_year)
df['Make'] = df['Make, Model, and More'].astype(str).map(extract_make)
df['Model'] = df['Make, Model, and More'].astype(str).map(extract_model)

In [24]:
df.head()

,UID,Name,Street,VIN,City & Zip,Zip,State,City,"Make, Model, and More",Year,Make,Model
0,50001,119 EMPIRE AVENUE LLC,119 EMPIRE AVE,3GCUYDED8KG101637,MERIDEN CT 06450-1928,06450,CT,MERIDEN,"CHEVR SILVERAD 2019 03 GRA 31,480",2019,CHEVR,SILVERAD
1,50002,480-492 CHAMBERLAIN HIGHWAY LLC,1400 OLD NORTH COLONY RD,98RC419975,MERIDEN CT 06450-1960,06450,CT,MERIDEN,FORD NONE 1950 25 BLA,1950,FORD,NONE
2,50003,A & F TRUCKING LLC,622 HANOVER RD,1XPHD49X4CD167519,MERIDEN CT 06451-5311,06451,CT,MERIDEN,"PTRB CONVENTI 2012 02 WHT 43,200",2012,PTRB,CONVENTI
3,50004,A & F TRUCKING LLC,622 HANOVER RD,1XPHD49X9DD191803,MERIDEN CT 06451-5311,06451,CT,MERIDEN,"PTRB CONVENTI 2013 02 RED 50,750",2013,PTRB,CONVENTI
4,50005,A & F TRUCKING LLC,622 HANOVER RD,1FUYDPYB6RP547101,MERIDEN CT 06451-5311,06451,CT,MERIDEN,FRHT CONV 1994 02 GRN,1994,FRHT,CONV

### check

In [25]:
len([i for i in df.Model.unique() if i.find(' ') != -1])

1833

In [26]:
df[df.Make == 'STEAL']

,UID,Name,Street,VIN,City & Zip,Zip,State,City,"Make, Model, and More",Year,Make,Model
2463,52464,BAKULA THERESA C,40 COTTAGE ST,5WFBE1212LW102626,MERIDEN CT 06450-4404,06450,CT,MERIDEN,"STEAL C6X12IF 2020 11 GRA 1,620",2020,STEAL,C6X12IF

In [27]:
s_test = 'CHEVR EXPRESS 2015 03 WHI 12,230'
match = re.search(r'.*([1-2][0129][0-9]{2})', s_test)

In [28]:
match.group(1)

'2015'

## manually add info for errored lines
    UID = 59270, 64442, and 83884

In [29]:
df.head()

,UID,Name,Street,VIN,City & Zip,Zip,State,City,"Make, Model, and More",Year,Make,Model
0,50001,119 EMPIRE AVENUE LLC,119 EMPIRE AVE,3GCUYDED8KG101637,MERIDEN CT 06450-1928,06450,CT,MERIDEN,"CHEVR SILVERAD 2019 03 GRA 31,480",2019,CHEVR,SILVERAD
1,50002,480-492 CHAMBERLAIN HIGHWAY LLC,1400 OLD NORTH COLONY RD,98RC419975,MERIDEN CT 06450-1960,06450,CT,MERIDEN,FORD NONE 1950 25 BLA,1950,FORD,NONE
2,50003,A & F TRUCKING LLC,622 HANOVER RD,1XPHD49X4CD167519,MERIDEN CT 06451-5311,06451,CT,MERIDEN,"PTRB CONVENTI 2012 02 WHT 43,200",2012,PTRB,CONVENTI
3,50004,A & F TRUCKING LLC,622 HANOVER RD,1XPHD49X9DD191803,MERIDEN CT 06451-5311,06451,CT,MERIDEN,"PTRB CONVENTI 2013 02 RED 50,750",2013,PTRB,CONVENTI
4,50005,A & F TRUCKING LLC,622 HANOVER RD,1FUYDPYB6RP547101,MERIDEN CT 06451-5311,06451,CT,MERIDEN,FRHT CONV 1994 02 GRN,1994,FRHT,CONV

In [30]:
df.loc[df.UID == 59270, 'City & Zip'] =  'MERIDEN CT 06450-'
df.loc[df.UID == 59270, 'Make, Model and More'] =  'HYUND ELANTRA 2008 01 GRA 1000 C 220 F'
df.loc[df.UID == 59270, 'City'] =  'MERIDEN'
df.loc[df.UID == 59270, 'State'] =  'CT'
df.loc[df.UID == 59270, 'Zip'] =  '06450'
df.loc[df.UID == 59270, 'Year'] =  '2008'
df.loc[df.UID == 59270, 'Make'] =  'HYUND'
df.loc[df.UID == 59270, 'Model'] =  'ELANTRA'

In [31]:
df.loc[df.UID == 64442, 'City & Zip'] =  'MERIDEN CT 06450-'
df.loc[df.UID == 64442, 'Make, Model and More'] =  'FORD F150 2009 01 GRA 1000 C 4,230 1000 E'
df.loc[df.UID == 64442, 'City'] =  'MERIDEN'
df.loc[df.UID == 64442, 'State'] =  'CT'
df.loc[df.UID == 64442, 'Zip'] =  '06450'
df.loc[df.UID == 64442, 'Year'] =  '2009'
df.loc[df.UID == 64442, 'Make'] =  'FORD'
df.loc[df.UID == 64442, 'Model'] =  'F150'

In [32]:
df.loc[df.UID == 83884, 'City & Zip'] =  'MERIDEN CT 06450-'
df.loc[df.UID == 83884, 'Make, Model and More'] =  'NISSA SENTRA S 2014 01 BLU 1000 C 1,250 1000 E'
df.loc[df.UID == 83884, 'City'] =  'MERIDEN'
df.loc[df.UID == 83884, 'State'] =  'CT'
df.loc[df.UID == 83884, 'Zip'] =  '06450'
df.loc[df.UID == 83884, 'Year'] =  '2014'
df.loc[df.UID == 83884, 'Make'] =  'NISSA'
df.loc[df.UID == 83884, 'Model'] =  'SENTRA S'

## store

In [33]:
f

'Meriden_MV_21.xlsx'

In [34]:
df.to_csv(sav_path + f.replace('xlsx', 'csv'))

# 2022.11.7 -- Seymour_MV_21.xlsx; saved as csv

In [291]:
os.listdir(path)

['Bridgewater_MV_21.pdf', 'Salem_MV_21.xls', 'Seymour_MV_21.xlsx']

## read

In [292]:
f = 'Seymour_MV_21.xlsx'

In [293]:
df = pd.read_excel(path + f)
df_copy = df.copy()

In [294]:
df.head()

,V2,V3,V4,V5,V6,V2.1,V3.1
0,50001,A & J GENERATOR AND EQUIPMENT LLC,2019,RAM,PROMASTE ZFBHRFAB6K6N27426 16...,"33 SAGAMORE DR SEYMOUR, CT 06483","16,000"
1,50002,A & J GENERATOR AND EQUIPMENT LLC,2020,RAM,PROMASTE ZFBHRFAB9L6R60806 18...,"33 SAGAMORE DR SEYMOUR, CT 06483","18,900"
2,50003,A & J GENERATOR AND EQUIPMENT LLC,2020,RAM,PROMASTE ZFBHRFAB1L6R67782 18...,"33 SAGAMORE DR SEYMOUR, CT 06483","18,900"
3,50004,A. H. EMERY COMPANY THE,2011 FORD,ECONOLIN,"1FTNE2EW5BDA03164 8,520","THE A.H. EMERY COMPANY D/B/A E SEYMOUR, CT 06483","8,520"
4,50005,A1 DRIVING.COM LLC,2017,NISSA,SENTRA S 3N1AB7AP7HY208626 ...,"214 W CHURCH ST SEYMOUR, CT 06483","9,780"

### check specific columns

In [306]:
pd.Series([len(i) for i in df['V4']]).unique()

array([ 4,  9, 10,  2,  5,  8, 14], dtype=int64)

In [307]:
df['l'] = df['V4'].astype(str).map(len)

In [308]:
df[df.l == 14]

,V2,V3,V4,V5,V6,V2.1,V3.1,l
12263,62298,SCHRYVER,S TREE SERVICE,2012,CAM 4EC16 5JPBU2025CP028694 ...,"18 ELAINE DR SEYMOUR, CT 06483","4,320",14

## connect entries, then extract

In [315]:
df = df.rename(columns={'V2': 'UID'})
df['l1'] = df.V3 + ' ' + df.V4 + ' ' + df.V5 + ' ' + df.V6
df['l2'] = df['V2.1'] + ' ' + df['V3.1']

### deal with l1

In [316]:
df.l1.head().tolist()

['A & J GENERATOR AND EQUIPMENT LLC 2019 RAM PROMASTE            ZFBHRFAB6K6N27426       16,000',
 'A & J GENERATOR AND EQUIPMENT LLC 2020 RAM PROMASTE            ZFBHRFAB9L6R60806       18,900',
 'A & J GENERATOR AND EQUIPMENT LLC 2020 RAM PROMASTE            ZFBHRFAB1L6R67782       18,900',
 'A. H. EMERY COMPANY THE 2011 FORD ECONOLIN 1FTNE2EW5BDA03164           8,520',
 'A1 DRIVING.COM LLC 2017 NISSA SENTRA S            3N1AB7AP7HY208626           9,780']

In [321]:
df.l1.str.strip()[3]

'A. H. EMERY COMPANY THE 2011 FORD ECONOLIN 1FTNE2EW5BDA03164           8,520'

In [364]:
def extract_year(s):
    match = re.search(r'([1-2][0129][0-9]{2})', s)
    if match != None:
        return match.group(1)
    else:
        return ''

def extract_name(s):
    return (s[:s.find(extract_year(s))-1])

In [417]:
def extract_make(s):
    year_loc = s.find(extract_year(s))
    # year has four digits
    return s[year_loc+5: s.find(' ', year_loc + 5)]

In [423]:
def extract_vin(s):
    begin_text = re.findall(r'\s{2}\w', s_test)[0]
    end_text = re.findall(r'\w\s{2}', s_test)[1]
    return s[s.find(begin_text) + 2: s.find(end_text) + 1]

In [435]:
def extract_model(s):
    make_loc = s.find(extract_make(s))
    len_make = len(extract_make(s))
    return s[make_loc+len_make+1: s.find('  ', make_loc+len_make+1)]

In [438]:
df['Year'] = df['l1'].astype(str).map(extract_year)
df['Name'] = df['l1'].astype(str).map(extract_name)
df['Make'] = df['l1'].astype(str).map(extract_make)
df['VIN'] = df['l1'].astype(str).map(extract_vin)
df['Model'] = df['l1'].astype(str).map(extract_model)

### testing

In [365]:
df.Year.unique()

array(['2019', '2020', '2011', '2017', '2016', '2015', '1972', '2012',
       '1962', '2010', '2003', '2007', '2013', '2008', '2009', '2004',
       '2018', '2021', '2006', '2014', '2005', '1998', '1974', '2001',
       '1988', '1999', '1994', '1997', '2000', '1977', '1996', '1995',
       '1987', '1982', '1986', '2002', '1990', '1991', '1964', '1978',
       '1992', '1984', '1951', '1968', '1935', '1934', '2022', '1970',
       '1985', '1969', '1993', '1989', '1976', '1973', '1980', '1959',
       '1967', '1966', '1983', '1971', '1956', '1955', '1965', '1960',
       '1949', '1975', '1939', '1936', '1981', '1979', '1953', '1933',
       '1948', '1963', '1961', '1945', '1957', '1915', '1926', '1924',
       '1927', '1952', '1930', '1947', '1932', '1931', '1941', '1940',
       '1954', '1958'], dtype=object)

In [379]:
df[df.Year == '1915'].l1.tolist()[0]

'JARVIS WILLIAM 1915 FORD T                   699538                     500'

In [386]:
s_test = 'ALVES JOE A 2007 AUDI A4 CABRL            WAUEF48H07K029967           4,670'
s_test.find(' ', s_test.find('2007')+5)

21

In [412]:
re.findall(r'\s{2}\w', s_test)[0]
re.findall(r'\w\s{2}', s_test)[1]

'7  '

In [387]:
s_test[16:21]

' AUDI'

In [388]:
df['doublespace'] = df.l1.apply(lambda x: x.find('  '))

In [389]:
df[df.doublespace == -1]

Empty DataFrame
Columns: [UID, V3, V4, V5, V6, V2.1, V3.1, l, l1, l2, Year, Name, doublespace]
Index: []

In [390]:
df = df.drop(columns=['doublespace'])

### deal with l2

In [439]:
df.l2.head()

0              33 SAGAMORE DR SEYMOUR, CT 06483 16,000
1              33 SAGAMORE DR SEYMOUR, CT 06483 18,900
2              33 SAGAMORE DR SEYMOUR, CT 06483 18,900
3    THE A.H. EMERY COMPANY D/B/A E SEYMOUR, CT 064...
4              214 W CHURCH ST SEYMOUR, CT 06483 9,780
Name: l2, dtype: object

In [450]:
df['Street'] = df.l2.apply(lambda x: x[:x.find(',')])
df['State'] = df.l2.apply(lambda x: x[x.find(',') + 2: x.find(',') + 4])

def extract_zip(s):
    match = re.search(r'([0-9]{5})', s)
    if match != None:
        return match.group(1)
    else:
        return ''

df['Zip'] = df.l2.map(extract_zip)

## keep wanted columns, and store

In [457]:
df = df[['UID', 'l1', 'l2', 'Name', 'Street', 'State', 'Zip', 'Make', 'Model', 'Year', 'VIN']]

In [458]:
f

'Seymour_MV_21.xlsx'

In [459]:
df.to_csv(sav_path + f.replace('xlsx', 'csv'))

# 2022.11.11 -- Salem_MV_21.xls; saved as csv

In [6]:
os.listdir(path)

['Bridgewater_MV_21.pdf', 'Salem_MV_21.xls']

## read

In [158]:
f = 'Salem_MV_21.xls'

In [160]:
df = pd.read_excel(path + f)
df_copy = df.copy()

## drop unwanted parts + find max UID

In [161]:
df = df.dropna(how='all')

In [162]:
empty_c_list = []
for c in df.columns:
    if len(df[c].unique().tolist()) == 1:
        empty_c_list.append(c)
df = df.drop(columns=empty_c_list)

In [163]:
df = df.rename(columns={'Unnamed: 0': 'UID'})

In [164]:
df.UID.unique()

array([10000, nan, 10001, ..., 280050, 280051, 'Page: Exemptions'],
      dtype=object)

In [165]:
row_drop_list = df.loc[df.UID == 'Letter: Exemptions'].index.tolist() + df.loc[df.UID == 'Page: Exemptions'].index.tolist()

In [166]:
df = df.drop(row_drop_list)

In [167]:
df.UID.max()

280064

## rows for each UID

In [102]:
df = df.reset_index().drop(columns=['index'])

In [130]:
uid_row_dict = {}
uid_missing_list = []
for uid in df.UID.unique():
    if uid == np.nan:
        continue
    if len(df[df.UID == uid].index.tolist()) == 0:
        uid_missing_list.append(uid)
    elif len(df[df.UID == uid].index.tolist()) == 1:
        i = df[df.UID == uid].index.tolist()[0]
    else:
        print(uid)
    uid_row_dict.update({uid: i})

In [134]:
# check data harmonization
for i in range(0, len(df.UID.unique()) - 1):
    uid_cur = [j for j in df.UID.unique() if j != np.nan][i]
    uid_next = [j for j in df.UID.unique() if j != np.nan][i+1]
    if uid_row_dict[uid_next] - uid_row_dict[uid_cur] != 4:
        print([uid_cur, uid_next])

[10000, nan]

## extract data

In [168]:
df.head()

,UID,Unnamed: 2,Unnamed: 5,Unnamed: 8,Unnamed: 11,Unnamed: 15,Unnamed: 17,Unnamed: 19,Unnamed: 21,Unnamed: 22,Unnamed: 25,Unnamed: 29,Unnamed: 31,Unnamed: 34,Unnamed: 36,Unnamed: 38,Unnamed: 41,Unnamed: 42
0,10000,ABETTI FRANK A,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35210,NaN
1,NaN,ABETTI DANA S,NaN,NaN,NaN,BMW,NaN,2020.0,NaN,X3 XDRIV,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,4 ROUND HILL RD,NaN,NaN,NaN,SportU,NaN,4.0,BLU,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35210,NaN
5,NaN,"SALEM, CT 06420-3850",NaN,NaN,NaN,5UXTS1C00L9D06190,NaN,NaN,NaN,NaN,NaN,NaN,4600.0,NaN,NaN,NaN,NaN,NaN
9,10001,ABISSI CHRISTOPHER M,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5160,NaN

In [169]:
# rename & keep only wanted columns
df = df.rename(columns={
    'Unnamed: 2': 'c1',
    'Unnamed: 15': 'c2',
    'Unnamed: 19': 'c3',
    'Unnamed: 22': 'c4'
})[['UID','c1','c2','c3','c4']]

In [181]:
df = df.reset_index().drop(columns=['index'])

In [182]:
df

         UID                     c1                 c2      c3        c4
0      10000         ABETTI FRANK A                NaN     NaN       NaN
1        NaN          ABETTI DANA S                BMW  2020.0  X3 XDRIV
2        NaN        4 ROUND HILL RD             SportU     4.0       NaN
3        NaN   SALEM, CT 06420-3850  5UXTS1C00L9D06190     NaN       NaN
4      10001   ABISSI CHRISTOPHER M                NaN     NaN       NaN
...      ...                    ...                ...     ...       ...
19321    NaN        JUHASZ CHERYL D              CHEVR  2003.0       S10
19322    NaN  306 Old Colchester Rd             PICKUP     6.0       NaN
19323    NaN                     52  1GCCS14X438104002     NaN       NaN
19324    NaN        SALEM, CT 06420                NaN     NaN       NaN
19325    NaN                    NaN                NaN     NaN       NaN

[19326 rows x 5 columns]

In [222]:
# fix one problem
df.loc[19323, 'c1'] = df.loc[19324, 'c1']

In [178]:
df_treated = pd.DataFrame(
    columns= ['Name','Street','City','State','Zip','Year','Make','Model','VIN'],
    index=[int(i) for i in uid_row_dict if i >= 0]
)

In [234]:
def extract_city(s):
    if s != s:      # check nan
        return np.nan
    elif s.find(',') == -1:
        return np.nan
    else:
        return s[:s.find(',')]

def extract_state(s):
    if s != s:
        return np.nan
    elif s.find(',') == -1:
        return np.nan
    else:
        return s[s.find(',') + 2: s.find(',') + 4]

def extract_zip(s):
    if s != s:
        return np.nan
    elif s.find(',') == -1:
        return np.nan
    else:
        return s[s.find(',') + 5: s.find(',') + 10]

for uid in df_treated.index:
    row_begin = uid_row_dict[uid]
    df_uid = df[row_begin:row_begin+4]
    df_treated.loc[uid, 'Name'] = df.loc[row_begin, 'c1']
    if df.loc[row_begin + 3, 'c1'] != df.loc[row_begin + 3, 'c1']:
        df_treated.loc[uid, 'Street'] = df.loc[row_begin+1, 'c1']
        city_state_zip = df.loc[row_begin+2, 'c1']
    else:
        df_treated.loc[uid, 'Street'] = df.loc[row_begin+2, 'c1']
        city_state_zip = df.loc[row_begin+3, 'c1']
    df_treated.loc[uid, 'City'] = extract_city(city_state_zip)
    df_treated.loc[uid, 'State'] = extract_state(city_state_zip)
    df_treated.loc[uid, 'Zip'] = extract_zip(city_state_zip)
    df_treated.loc[uid, 'Year'] = int(df.loc[row_begin+1, 'c3'])
    df_treated.loc[uid, 'Make'] = df.loc[row_begin+1, 'c2']
    df_treated.loc[uid, 'Model'] = df.loc[row_begin+1, 'c4']
    df_treated.loc[uid, 'VIN'] = df.loc[row_begin+3, 'c2']

### check

In [237]:
df_treated.City.unique()

array(['SALEM', 'ARLINGTON', 'MOOSUP', 'NORWICH', 'MYSTIC', 'COLCHESTER',
       'CROMWELL', 'MOUNT LAUREL', 'BOZRAH', 'NEW HAVEN', 'EAST LYME',
       'COLUMBIA', 'GROTON', 'NAUGATUCK', 'NEW MILFORD', 'ESSEX N',
       'WINDSOR', 'WEST HAVEN', 'DULUTH', 'DEEP RIVER', 'DALLAS',
       'BROOKFIELD', 'WATERFORD', 'STONINGTON', 'FORT WORTH', 'NIANTIC',
       'UNCASVILLE', 'SPARKS', 'SOUTH WINDSOR', 'NEW HARTFORD',
       'EAST HARTFORD', 'SUN CITY', 'WILMINGTON', 'WARREN', 'VERNON',
       'TORRINGTON', 'HILLIARD', 'NORTH PORT', 'OAKDALE',
       'MANSFIELD CENTER', 'EAST HADDAM', 'EAST GRANBY', 'PAWCATUCK',
       'TORRANCE', 'PRESTON', 'ATLANTA', 'FOUNTAIN VALLEY', 'SOUTHINGTON',
       'ST PETERSBURG', 'SUFFIELD', 'NEW BRITAIN', 'NAPLES', 'ALPHARETTA',
       'AMSTON', 'BEACON FALLS', 'ALAMEDA', 'OLD LYME', 'OLD SAYBROOK',
       'WINDHAM', 'MERIDEN', 'TERRYVILLE', 'SAMEM', 'SACRAMENTO',
       'CANTERBURY', 'CLINTON', 'MOODUS', 'BROOKLYN', 'EAST NORTHPORT',
       'WALLINGFORD', 'ROCKY HILL', 'LEBANON', 'ANSONIA', 'CHANDLER',
       'FORT MYERS', 'OSHKOSH', 'DETROIT', 'LIBERTYVILLE', 'RIDGE MANOR',
       'DES PLAINES', 'MARLBOROUGH'], dtype=object)

In [230]:
df_treated.State.unique()

array(['CT', 'TX', 'NJ', 'NY', 'GA', 'MD', 'AZ', 'NC', 'VT', 'OH', 'FL',
       'CA', 'WI', 'MI', 'IL'], dtype=object)

In [238]:
df_treated.Zip.unique()

array(['06420', '76014', '06354', '06360', '06355', '06415', '06416',
       '08054', '06334', '06511', '06333', '06237', '06340', '06770',
       '06776', '12936', '06095', '06516', '30096', '06417', '75201',
       '06804', '06385', '06378', '76177', '06357', '06382', '21152',
       '06074', '06057', '06118', '85373', '21044', '28409', '05674',
       '06066', '06790', '43026', '34287', '06370', '06250', '06423',
       '06026', '06379', '90501', '06365', '06510', '30339', '92708',
       '06489', '76101', '33703', '06078', '06053', '34114', '30009',
       '06231', '06403', '94501', '06371', '06475', '06280', '06450',
       '06786', '95865', '06331', '06413', '06469', '11234', '11731',
       '06492', '06067', '06108', '00000', '06249', '06401', '85226',
       '33908', '54902', '48226', '60048', '33523', '60016', '06447'],
      dtype=object)

In [240]:
np.unique([len(i) for i in df_treated.VIN])

array([ 3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17])

In [243]:
df_treated['l'] = df_treated.VIN.map(len)

In [255]:
df_treated[df_treated.l == 3]

,Name,Street,City,State,Zip,Year,Make,Model,VIN,l
210427,SWAN KANDIS M,117 SKYLINE DR,SALEM,CT,06420,1980,STERL,8514,908,3

In [256]:
a = uid_row_dict[210427]
df[a: a+5]

          UID                    c1      c2      c3    c4
16520  210427         SWAN KANDIS M     NaN     NaN   NaN
16521     NaN        117 SKYLINE DR   STERL  1980.0  8514
16522     NaN  SALEM, CT 06420-4108  TRAILE     0.0   NaN
16523     NaN                   NaN     908     NaN   NaN
16524  210428         SWAN KANDIS M     NaN     NaN   NaN

In [257]:
df_treated.Year.unique()

array([2020, 2009, 2006, 2018, 2001, 2019, 2021, 2013, 2012, 2005, 2011,
       1986, 2015, 2014, 2010, 1994, 2007, 1963, 2017, 2016, 2008, 1995,
       1999, 1993, 2002, 1988, 2004, 1977, 1990, 1968, 1980, 1998, 2003,
       2022, 1985, 1972, 1978, 1974, 2000, 1989, 1997, 1981, 1987, 1976,
       1965, 1991, 1996, 1992, 1955, 1979, 1950, 1962, 1970, 1975, 1982,
       1941, 1956, 1957, 1949, 1984, 1969, 1973, 1971, 1967, 1983, 1947,
       1952, 1932, 1959, 1931, 1934, 1960, 1966, 1951, 1948, 1930, 1928,
       1936, 1939, 1954], dtype=object)

In [258]:
df_treated.Make.unique()

array(['BMW', 'SUBAR', 'FORD', 'NISSA', 'TOYOT', 'CADIL', 'CHEVR', 'GMC',
       'BUICK', 'TARTE', 'CARRY', 'JEEP', 'HONDA', 'DODGE', 'CORRE',
       'STEAD', 'VOLKS', 'HYUND', 'THULE', 'CAM', 'STUDE', 'LOADR',
       'KZ SP', 'KIA', 'JAYCO', 'HARLE', 'SURE-', 'WORKH', 'LONG', 'EZ',
       'VENTU', 'LEXUS', 'LINCO', 'AUDI', 'MERCE', 'OLDSM', 'DILLY',
       'SUPER', 'RAM', 'CHRYS', 'SUZUK', 'HOMEM', 'FOURW', 'CARGO',
       'VOLVO', 'ACURA', 'HOME', 'REISE', 'NORTO', 'HM', 'DUCAT', 'KAWAS',
       'HARLD', 'CARMA', 'TRIAD', 'BRIMA', 'SHORE', 'FREIG', 'HHYLI',
       'COLEM', 'INFIN', 'SNOWB', 'KARAV', 'ALUMA', 'INTER', 'PONTI',
       'SAAB', 'KEYST', 'ANDER', 'SU/TR', 'MINI', 'BIGT', 'KTM', 'WOODM',
       'TARAV', 'SIERR', 'BGTEX', 'FORES', 'EAST', 'MAC T', 'VICTO',
       'MAZDA', 'BRAVO', 'HURST', 'JAGUA', 'HOLSC', 'MG', 'MGA', 'SURE',
       'THOR', 'BIG T', 'BISON', '5STAR', 'BWISE', 'QUALI', 'BRI-M',
       'SALSC', 'BOWIE', 'NORTH', 'ROAD', 'CUSTO', 'HAULI', 'TRAIL',
       'NUWAY', 'MAGIC', 'UNKNO', 'URAL', 'VERME', 'KAUF', 'MERCU',
       'STRAT', 'TANZE', 'COYOT', 'YAMAH', 'BLACK', 'ROCKW', 'AMERI',
       'FLOE', 'TRITO', 'VENTR', 'HIGHL', 'BIGTE', 'DESOT', 'WELLS',
       'USCAR', 'LOAD', 'MONTA', 'FEATH', 'PACE', 'SALEM', 'JOHND',
       'SATUR', 'SPRIN', 'CIRD', 'KZCOY', 'FLAGS', 'PETER', 'CHANG', 'HH',
       'MATCH', 'PIAGG', 'VESPA', 'OPEN', 'ISUZU', 'CYNER', 'COTNE',
       'JAY F', 'ECONO', 'TRANS', 'CAM S', 'HAUL', 'SULLI', 'KENWO',
       'FELLI', 'EZ LO', 'CHEVY', 'CONTI', 'AMC', 'RANGE', 'INTEG',
       'BIGTX', 'KAUFM', 'PARKE', 'GENES', 'SHORL', 'FLYER', 'OUTBA',
       'SHOOP', 'MAXIM', 'WINNE', 'ROADM', 'TIMBE', 'WHITE', 'DELTA',
       'P.J.', 'PROWL', 'FAN', 'MOTOG', 'WILDW', 'SGAC', 'VMA', 'COX',
       'SUND', 'SAILB', 'SKEET', 'JACKS', 'SURVE', 'HOLSE', 'PACEA',
       'EXPRE', 'SEALI', 'COREY', 'DOOLI', 'SMART', 'MOUNT', 'TEENE',
       'SLEDB', 'EZLO', 'WILLY', 'PLYMO', 'COACH', 'TERRY', 'STARC',
       'TRITN', 'SMITH', 'HMADE', 'VINTA', 'IN TE', 'CHALE', 'EXPRS',
       'INDIA', 'PORSC', 'SERRO', 'WORTH', 'SKL', 'TRIUM', 'ANGEL',
       'BULLE', 'SUNLI', 'MITSU', 'CITAT', 'SHAST', 'FIAT', 'EVERL',
       'ARON', 'CAN-A', 'VALLE', 'TESLA', 'TOYTA', 'EAGER', 'HAWK',
       'SKAMP', 'U-HAU', 'HUMME', 'SGREE', 'RIVER', 'MASER', 'HEART',
       'PJ TR', 'SUNNY', 'LAND', 'COMPO', 'BOAT', 'PALOM', 'COMMO',
       'EAGLE', 'SUNDO', 'SOLIT', 'EZLOA', 'MAST', 'RAMLI', 'SURET',
       'EXISS', 'CHLG', 'BASS', 'N & N', 'EZDMP', 'MTT', 'NOVAE', 'HIGH',
       'BLUE', 'ADMIR', 'MOTO', 'MYCO', 'DIMND', 'SOL', 'VEN', 'SUN',
       'HURRI', 'PUMA', 'KZFRO', '4WINN', 'EZ DU', 'STEAL', 'TAMAR',
       'TURTL', 'ESCOR', 'TRLX', 'PLEAS', 'DOWN', 'ELGIN', 'TRMPH',
       'CHAIR', 'YONGQ', 'GLADI', 'DIAMO', 'KEYS', 'PEQUE', 'KAISE',
       'JUNIO', 'FORD*', 'HAULN', 'CROSS', 'CAR M', 'UNITE', 'AUSHE',
       'SPART', '5 STA', 'MAXEY', 'VENT', 'SNOPR', 'GOLDS', 'WARLO',
       'HIPNT', 'LOOK', 'ITASC', 'CORR2', 'WESC', 'MACK', 'ARTIC',
       'MASTE', 'NN TR', 'P J', 'RENEG', 'FLEET', 'BETTE', 'AMIDA',
       'ALFA', 'LARK', 'FO/WI', 'GRAND', 'CHAMP', 'GEO', 'BIG', 'KINGS',
       'REMEQ', 'M6', 'SEA R', 'NOAAN', 'SKIPP', 'DURA', 'STERL', 'GLASR',
       'CM', 'LITE', 'S S T', 'HIGHC', 'FOXTR', 'ROCKE', 'TIDEW', 'HORNE',
       'WILLO', 'LADY', 'BONAN', 'SEA L', 'TOUCH', 'E Z L', 'TRACK', 'PJ',
       'HMMDE', 'NOMAN', 'LAUNC', 'CHERO', 'TEE N', 'JACO', 'NOMAD',
       'BUELL', 'SNOW'], dtype=object)

In [270]:
a = uid_row_dict[df_treated[df_treated.Make == 'EZ LO'].index.tolist()[0]]
df[a: a+5]

        UID                    c1                 c2      c3     c4
3848  60033         DAVIS KEVIN L                NaN     NaN    NaN
3849    NaN  209 OLD COLCHESTER R              EZ LO  1989.0  M17P1
3850    NaN       SALEM, CT 06420             TRAILE     0.0    NaN
3851    NaN                   NaN  405117BMXKD000062     NaN    NaN
3852  60034         DAVIS KEVIN L                NaN     NaN    NaN

In [275]:
df_treated = df_treated.drop(columns=['l'])

## store

In [276]:
f

'Salem_MV_21.xls'

In [277]:
df_treated.to_csv(sav_path+f.replace('xls', 'csv'))

# 2022.11.15 -- Bridgewater_MV_21.pdf; unsuccessful, consider other methods

In [4]:
os.listdir(path)

['Bridgewater_MV_21.pdf']

## read

In [5]:
f = 'Bridgewater_MV_21.pdf'

In [14]:
tabula.convert_into(path + f, path + f.replace('.pdf', '_middle.csv'), output_format="csv", pages='1-124')

In [68]:
df = pd.read_csv(path + f.replace('.pdf', '_middle.csv'), skiprows=1, skipfooter=1)
df = df.rename(columns={'UNIQUE#': 'UID', 'ADDRESS CITY/ST/ZIP': 'c1', 'Unnamed: 2': 'c2', 'Unnamed: 3': 'c3', 'CL': 'c4', 
'IDENTIFICATION':'c5', 'Unnamed: 6': 'c6', 'Unnamed: 7': 'c7', 'WEIGHT': 'c8', 'EXEMPT':'c9', 'EXEMPT.1': 'c10', 'NET': 'c11'})

C:\Users\leoqi\AppData\Roaming\Python\Python37\site-packages\pandas\util\_decorators.py:311: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  return func(*args, **kwargs)

In [69]:
df.head()

,UID,c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11
0,50001,ABBETT LINDA J ABBETT MARILYN S,NaN,NaN,WHI 2016,TOYOT RAV4 LIM WAGON,NaN,NaN,"3,616",NaN,NaN,"17,240"
1,50001,PO BOX 357 BRIDGEWATER CT 06752-0357,NaN,NaN,01,2T3DFREV1GW496859,NaN,NaN,"6,000",NaN,NaN,"17,240"
2,NaN,121 CLATTER VALLEY RD BRIDGEWATER CT 06752-,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,50002,ABBETT LINDA J,NaN,NaN,BLU 2007,TOYOT RAV4,WAGON,NaN,NaN,NaN,NaN,"5,250"
4,50002,PO BOX 357 BRIDGEWATER CT 06752-0357,NaN,NaN,01,JTMBD33V476023102,NaN,NaN,NaN,NaN,NaN,"5,250"

In [118]:
# replace nan/none with ''
df = df.fillna('')

In [70]:
# drop invalid rows
'''
uid_text_list = []
for i in df.index:
    try: 
        float(df.loc[i,'UID'])
    except ValueError:
        uid_text_list.append(i)

df = df.drop(index=uid_text_list).reset_index().drop(columns=['index'])
'''

"\nuid_text_list = []\nfor i in df.index:\n    try: \n        float(df.loc[i,'UID'])\n    except ValueError:\n        uid_text_list.append(i)\n\ndf = df.drop(index=uid_text_list).reset_index().drop(columns=['index'])\n"

## append info

In [119]:
uid_list = []
uid_text_list = []
for i in df.index:
    try: 
        a = int(df.loc[i,'UID'])
        if a >= 50000 and a <= 60000 and a not in uid_list:
            uid_list.append(a)
    except ValueError:
        uid_text_list.append(i)

In [138]:
df_treated = pd.DataFrame(index = uid_list)
df_col_list = ['c{}'.format(i) for i in range(1, 12)]

for uid in uid_list:
    i_begin = df[df.UID == str(uid)].index[0]
    l1 = ' '.join([df.loc[i_begin, c] for c in df_col_list])
    l2 = ' '.join([df.loc[i_begin+1, c] for c in df_col_list])
    if i_begin+2 in df.index and df.loc[i_begin+2, 'UID'] != '':
        l3 = ' '.join([df.loc[i_begin+2, c] for c in df_col_list])
    else:
        l3 = ''
    
    df_treated.loc[uid, 'l1'] = l1
    df_treated.loc[uid, 'l2'] = l2
    df_treated.loc[uid, 'l3'] = l3

    df_treated.loc[uid, 'Name'] = df.loc[i_begin, 'c1']

df_treated = df_treated.reset_index().rename(columns={'index':'UID'})

In [139]:
df_treated

,UID,l1,l2,l3,Name
0,50001,ABBETT LINDA J ABBETT MARILYN S WHI 2016 TOY...,PO BOX 357 BRIDGEWATER CT 06752-0357 01 2T3D...,,ABBETT LINDA J ABBETT MARILYN S
1,50002,ABBETT LINDA J BLU 2007 TOYOT RAV4 WAGON ...,PO BOX 357 BRIDGEWATER CT 06752-0357 01 JTMB...,,ABBETT LINDA J
2,50003,ABBETT MARILYN S ABBETT LINDA J SIL 2016 TOY...,PO BOX 126 BRIDGEWATER CT 06752-0126 01 JTMD...,,ABBETT MARILYN S ABBETT LINDA J
3,50004,ABBEY RESTAURANT LLC GRA 2017 CHEVR EXPRESS ...,11 CEDAR HILL RD BRIDGEWATER CT 06752-1001 0...,ABBOTT CHARLES D GRA 1988 KARAV KR2575 TRAIL...,ABBEY RESTAURANT LLC
4,50005,ABBOTT CHARLES D GRA 1988 KARAV KR2575 TRAIL...,113 HENRY SANFORD RD BRIDGEWATER CT 06752-1214...,ABBOTT CHARLES D TAN 1985 COLEM SEQOUIA TRAI...,ABBOTT CHARLES D
...,...,...,...,...,...
1619,52010,ZANDONELLA VICTORIA D GRA 2005 BMW F650GS EN...,155 CHRISTIAN ST BRIDGEWATER CT 06752-1426 12...,ZANDONELLA VICTORIA D GRA 2015 AUDI S3 PREMI...,ZANDONELLA VICTORIA D
1620,52011,ZANDONELLA VICTORIA D GRA 2015 AUDI S3 PREMI...,155 CHRISTIAN ST BRIDGEWATER CT 06752-1426 01...,ZANDONELLA VICTORIA D GRA 2019 VOLVO XC40 MO...,ZANDONELLA VICTORIA D
1621,52012,ZANDONELLA VICTORIA D GRA 2019 VOLVO XC40 MO...,155 CHRISTIAN ST BRIDGEWATER CT 06752-1426 01...,ZUCCA RICHARD GRA 2010 KARAV PK2400 BT TRL ...,ZANDONELLA VICTORIA D
1622,52013,ZUCCA RICHARD GRA 2010 KARAV PK2400 BT TRL ...,25 BLUEBERRY HILL RD BRIDGEWATER CT 06752- 11...,ZUCCA RICHARD RED 2016 JEEP CHEROKEE WAGON ...,ZUCCA RICHARD
1623,52014,ZUCCA RICHARD RED 2016 JEEP CHEROKEE WAGON ...,25 BLUEBERRY HILL RD BRIDGEWATER CT 06752- 01...,,ZUCCA RICHARD

In [140]:
df_treated['space_in_name'] = df_treated.Name.apply(lambda x: len([i for i in x if i == ' ']))

In [141]:
df_treated.space_in_name.unique()

array([5, 2, 3, 1, 4, 6, 7], dtype=int64)

In [142]:
df_treated[df_treated.space_in_name == 4]

,UID,l1,l2,l3,Name,space_in_name
40,50041,ALLOW ME PROPERTY MGMT SE WHI 2015 CHEVR SILV...,PO BOX 2332 NEW PRESTON CT 06777-0332 02 1GB3...,,ALLOW ME PROPERTY MGMT SE,4
152,50176,BONOMO INGRID H HUBATA HENRIETTA GRA 2012 TOY...,102 WEWAKA BROOK RD BRIDGEWATER CT 06752-1712 ...,BORGEEST UWE F GRA 2018 FORD EXPLORER SPORT ...,BONOMO INGRID H HUBATA HENRIETTA,4
162,50202,BROWN COLIN N BROWN SHARON BLA 2012 CHEVR SIL...,24 SARAH SANFORD RD BRIDGEWATER CT 06752- 01 ...,,BROWN COLIN N BROWN SHARON,4
245,50315,CHARLES A GAAL CONSTRUCTION LLC,"WHI 2004 FORD ECONOLIN CARGO 7,000 5,370",429 HUT HILL RD BRIDGEWATER CT 06752- 03 1FT...,CHARLES A GAAL CONSTRUCTION LLC,4
468,50599,ESPINOSA FERNANDO ESPINOSA REYNA A GRA 2020 ...,64 TOWN LINE RD BRIDGEWATER CT 06752-1515 01 ...,ESPINOSA FERNANDO ESPINOSA REYNA A 2020 SUBA...,ESPINOSA FERNANDO ESPINOSA REYNA A,4
469,52042,ESPINOSA FERNANDO ESPINOSA REYNA A 2020 SUBA...,64 TOWN LINE ROAD BRIDGEWATER CT 06752- 01 J...,ESPINOSA FERNANDO 2013 VOLKS PASSAT S SEDAN ...,ESPINOSA FERNANDO ESPINOSA REYNA A,4
519,50674,FRATTALONE ANN GIARRATANO DONALD J RED 1950 W...,15 BILBERRY RD BRIDGEWATER CT 06752-1302 25 6...,FREITAS ALEXANDRA W WHI 2018 VOLVO XC60 T6 WA...,FRATTALONE ANN GIARRATANO DONALD J,4
533,50688,GALHARDI-BARROSO GUILHERME ALVARENGA ISABELLA ...,417 OLD TURNPIKE RD E BRIDGEWATER CT 06752-112...,GALLAGHER JO A BLA 2014 HONDA CR-V LX WAGON ...,GALHARDI-BARROSO GUILHERME ALVARENGA ISABELLA L,4
561,50716,GIARRATANO DONALD J FRATTALONE ANN RED 2006 ...,33 MAIN ST N BRIDGEWATER CT 06752-1219 39 4X...,GILMORE LOIS S SIL 2017 JEEP GRAND CH SPORT ...,GIARRATANO DONALD J FRATTALONE ANN,4
568,50723,GIUSTI ROBERT G GIUSTI GRACE GRA 1999 PORSC ...,170 SKYLINE RIDGE RD BRIDGEWATER CT 06752-1729...,,GIUSTI ROBERT G GIUSTI GRACE,4
596,50751,BOX 302 BRIDGEWATER CT 06752-0302 01 JM1NA351...,34 GARRITY LA BRIDGEWATER CT 06752-,GORDON GARY W TAN 2015 JEEP CHEROKEE WAGON 1...,BOX 302 BRIDGEWATER CT 06752-0302,4
599,50754,GOVERNALE JOSHUA L GOVERNALE ANNEMARIE BLA 20...,100 OLD TOWN HWY BRIDGEWATER CT 06752-1119 01...,GOVERNALE JOSHUA L GOVERNALE ANNEMARIE GRA 20...,GOVERNALE JOSHUA L GOVERNALE ANNEMARIE,4
600,50755,GOVERNALE JOSHUA L GOVERNALE ANNEMARIE GRA 20...,100 OLD TOWN HWY BRIDGEWATER CT 06752-1119 01...,GOWISNOCK BARBARA A BLA 2017 MERCE GL550 4 SP...,GOVERNALE JOSHUA L GOVERNALE ANNEMARIE,4
629,50813,HAGER EDWARD HAGER BARBARA H BLU 2009 TOYOT ...,212 MAIN ST N BRIDGEWATER CT 06752-1223 01 4...,HANLON JEAN D SIL 2018 SUBAR CROSSTRE WAGON ...,HAGER EDWARD HAGER BARBARA H,4
709,50893,HOBBS KEVIN J HOBBS FRANZISKA BLU 2016 VOLKS...,138 MAIN ST S BRIDGEWATER CT 06752-1518 01 3...,HOBBS KEVIN J HOBBS FRANZISKA GRA 2017 VOLKS...,HOBBS KEVIN J HOBBS FRANZISKA,4
710,50894,HOBBS KEVIN J HOBBS FRANZISKA GRA 2017 VOLKS...,138 MAIN ST S BRIDGEWATER CT 06752-1518 01 3...,HOCHSTETTER FRANCIS G TAN 2007 TOYOT HIGHLAN...,HOBBS KEVIN J HOBBS FRANZISKA,4
740,50924,HRITZ ANNMARIE HRITZ KEVIN A BLA 2010 MERCE C3...,PO BOX 12 GAYLORDSVILLE CT 06755-0012 01 WDDGF...,,HRITZ ANNMARIE HRITZ KEVIN A,4
776,50974,JP MORGAN CHASE BANK NA WHI 2021 SUBAR LEGACY ...,P O BOX 901098 FORT WORTH TX 76101- 01 4S3BWAC...,,JP MORGAN CHASE BANK NA,4
777,50975,JP MORGAN CHASE BANK NA SIL 2018 SUBAR CROSSTR...,P O BOX 901098 FORT WORTH TX 76101- 01 JF2GTAB...,,JP MORGAN CHASE BANK NA,4
778,50976,JP MORGAN CHASE BANK NA RED 2019 MAZDA CX-5 TO...,P O BOX 901098 FORT WORTH TX 76101- 01 JM3KFBC...,,JP MORGAN CHASE BANK NA,4
779,50977,JP MORGAN CHASE BANK NA WHI 2019 SUBAR FORESTE...,P O BOX 901098 FORT WORTH TX 76101- 01 JF2SKAG...,,JP MORGAN CHASE BANK NA,4
780,50978,JP MORGAN CHASE BANK NA BLU 2020 LAND RANGE RO...,P O BOX 901098 FORT WORTH TX 76101- 01 SALWR2S...,,JP MORGAN CHASE BANK NA,4
781,50979,JP MORGAN CHASE BANK NA BLA 2020 MAZDA CX-5 SP...,P O BOX 901098 FORT WORTH TX 76101- 01 JM3KFBB...,,JP MORGAN CHASE BANK NA,4
782,50980,JP MORGAN CHASE BANK NA SIL 2020 SUBAR IMPREZA...,P O BOX 901098 FORT WORTH TX 76101- 01 4S3GKAB...,,JP MORGAN CHASE BANK NA,4
783,50981,JP MORGAN CHASE BANK NA ORA 2020 SUBAR CROSSTR...,P O BOX 901098 FORT WORTH TX 76101- 01 JF2GTAP...,,JP MORGAN CHASE BANK NA,4
784,50982,JP MORGAN CHASE BANK NA BLA 2020 SUBAR OUTBACK...,P O BOX 901098 FORT WORTH TX 76101- 01 4S4BTAC...,,JP MORGAN CHASE BANK NA,4
785,50983,JP MORGAN CHASE BANK NA GRA 2021 SUBAR CROSSTR...,P O BOX 901098 FORT WORTH TX 76101- 01 JF2GTAE...,,JP MORGAN CHASE BANK NA,4
875,51072,LAMPLOUGH NICHOLAS J BRENNAN KRISTIN YEL 1972...,TAXPAYER NAME 2ND NAME D COL YEAR MAKE MODEL ...,ADDRESS CITY/ST/ZIP CL IDENTIFICATION WEIG...,LAMPLOUGH NICHOLAS J BRENNAN KRISTIN,4
1019,51294,MIDDENDORF RICHARD W ROSEN-MIDDENDORF NIKKI T...,30 STUART RD E BRIDGEWATER CT 06752-1512 01 2...,MIHAYLO GEORGE JR MIHAYLO ROSALIND RED 2013 ...,MIDDENDORF RICHARD W ROSEN-MIDDENDORF NIKKI,4
1181,51484,RANNESTAD HAROLD RANNESTAD JOYCE E WHI 2008 T...,PO BOX 446 BRIDGEWATER CT 06752-0446 01 4T1BE...,,RANNESTAD HAROLD RANNESTAD JOYCE E,4
1182,51485,RANNESTAD JOYCE E RANNESTAD HAROLD GRA 2015 S...,152 MAIN ST S BRIDGEWATER CT 06752-1518 01 4S...,READ CURTIS S JR RED 2006 FORD F150 4 DOOR 2...,RANNESTAD JOYCE E RANNESTAD HAROLD,4
1249,51551,SARUBBI DONALD J SARUBBI MICHELLE BLA 2014 CA...,58 HAMBROCK LN BRIDGEWATER CT 06752-1528 01 1...,SARUBBI MICHELLE GRA 2011 KIA FORTE EX COUPE ...,SARUBBI DONALD J SARUBBI MICHELLE,4
1405,51737,STUART WILLIAM T SHALLOWBROOK FARM WHI 2018 K...,1 CURTIS RD BRIDGEWATER CT 06752-1205 04 1K91...,STUART-BULLOCK DANA B GRE 2019 SUBAR OUTBACK ...,STUART WILLIAM T SHALLOWBROOK FARM,4
1437,51789,THOMPSON LESLIE W AMOROSSI CHRISTINE BLA 1964...,26 NEW MILFORD RD E BRIDGEWATER CT 06752-1137 ...,THOMPSON LESLIE W BLA 2012 CARRY 6X86WZKP UTI...,THOMPSON LESLIE W AMOROSSI CHRISTINE,4
1476,51839,VALZANIA GEORGE VALZANIA BARBARA S GRA 2018 H...,9 CAMBRIDGE CIR NEW MILFORD CT 06776-3921 01 ...,VANHEMERT DONALD RED 1982 HOMEM CUSTOM TRAILE...,VALZANIA GEORGE VALZANIA BARBARA S,4
1584,51960,WISHMAN SEYMOUR A EVANS NANCY BLA 2008 BMW 3...,66 SKYLINE RIDGE RD BRIDGEWATER CT 06752-1727 ...,,WISHMAN SEYMOUR A EVANS NANCY,4

# 2022.12.13 -- 141_Thompson_MV_21.xlsx

In [15]:
f = '141_Thompson_MV_21.xlsx'
df = pd.read_excel(path + f)

In [16]:
df.head()

,id,taxpayer_name,2nd_name,vin,mail_address
0,50001,A J MANUFACTURING LLC,NaN,5J8TC2H76ML031311,PO BOX 435 THOMPSON CT 06277-0435
1,50002,A J MANUFACTURING LLC,BELLAVANCE PAMELA M,5NMS3CAA6LH159246,PO BOX 435 THOMPSON CT 06277-0435
2,50003,A J MANUFACTURING LLC,NaN,1FTNF21548ED70960,PO BOX 435 THOMPSON CT 06277-0435
3,50004,A J MANUFACTURING LLC,NaN,1TTEL718974010348,PO BOX 435 THOMPSON CT 06277-0435
4,50005,ABBAMONTE PATRICIA L,NaN,JTMRFREV3FD155271,9A MASON TERRACE GROSVENORDALE CT 06246-

In [17]:
def extract_zip(s):
    return str(int(s[s.find('-') - 5: s.find('-')])).zfill(5)

def extract_state(s):
    zip = extract_zip(s)
    return s[s.find(zip) - 3: s.find(zip) - 1]

def extract_address(s):
    st = extract_state(s)
    return s[:s.find(st) - 1]

df['zip'] = df.mail_address.map(extract_zip)
df['state'] = df.mail_address.map(extract_state)
df['street'] = df.mail_address.map(extract_address)

In [18]:
df = df.drop(columns=['mail_address'])
df.to_excel(sav_path + f)

# 2022.10.14 -- 131_Southington_MV_21.xlsx

In [38]:
f = '131_Southington_MV_21.xlsx'
df = pd.read_excel(path + f)
df = df.replace(np.nan, '')

In [41]:
df['City'] = df['Town/State/Zip'].apply(lambda x: x[:x.find(',')])
df['State'] = df['Town/State/Zip'].apply(lambda x: x[x.find(',')+2:x.find(',')+4])
df['Zip'] = df['Town/State/Zip'].apply(lambda x: x[x.find(',')+5:x.find(',')+10])

In [42]:
df[df.Zip == '']

,Name,Street Address,Town/State/Zip,Class,Year,Make,Model,Body,VIN,City,State,Zip
33408,ROVILLO PHILIP JOHN,32 WEST CENTER ST,,12,2002,MOTO,CALIFORN,MOTORC,ZGUKDBKD02M154290,,,
34119,SANTIAGO DYANA,31 DARLING STREET,,1,2009,MERCU,MARINER,WAGON4,4M2CU81749KJ03526,,,

In [43]:
df.Zip.unique()

array(['06489', '06032', '06479', ..., '06849', 'SKYVI', ' MER '],
      dtype=object)

In [48]:
df[df.Zip.str.isnumeric() != True]

,Name,Street Address,Town/State/Zip,Class,Year,Make,Model,Body,VIN,City,State,Zip
79,A. FIORILLO & CO. LLC,PO BOX 500,396 CLARK STREET,1,2016,CHEVR,EQUINOX,WAGON4,2GNFLEEKXG6207450,396 CLARK STREE,96,CLARK
95,AARON ROBERT J,AARON JODI ANN,107 MARCY DR,1,2015,HONDA,PILOT EX,WAGON4,5FNYF4H52FB066312,107 MARCY D,07,MARCY
96,AARON ROBERT J,AARON JODI ANN,107 MARCY DR,1,2017,HONDA,PILOT EX,WAGON4,5FNYF6H57HB023907,107 MARCY D,07,MARCY
99,ABASTILLAS RENATO S JR,ABASTILLAS ANNALIZA,174 ROCHELA DR,1,2018,TOYOT,SIENNA X,VAN,5TDDZ3DC8JS199682,174 ROCHELA D,74,ROCHE
114,ABBATIELLO SALVATORE J,ABBATIELLO MADELEINE,381 MULBERRY ST,1,2011,CHEVR,EQUINOX,WAGON4,2CNFLNE51B6414400,381 MULBERRY S,81,MULBE
...,...,...,...,...,...,...,...,...,...,...,...,...
42976,ZYSK ANDREW S,ZYSK CHRISTINE A,76 HOMESDALE AVE,1,2019,TOYOT,TACOMA D,PICKUP,3TMCZ5AN6KM242060,76 HOMESDALE AV,6,OMESD
42977,ZYSK CHRISTINE A,ZYSK ANDREW S,76 HOMESDALE AVE,1,2011,NISSA,ALTIMA S,SEDAN4,1N4BL2AP5BN490213,76 HOMESDALE AV,6,OMESD
42983,ZYSK LESZEK M,ZYSK RENATA,77 SUNNYSLOPE DR,1,2012,MERCE,ML350,WAGON4,4JGDA5HB0CA062719,77 SUNNYSLOPE D,7,UNNYS
42984,ZYSK LESZEK M,ZYSK RENATA,77 SUNNYSLOPE DR,1,2012,TOYOT,HIGHLAND,WAGON4,5TDDK3EH4CS140176,77 SUNNYSLOPE D,7,UNNYS
42987,ZYSK LESZEK M,ZYSK RENATA,77 SUNNYSLOPE DR,1,2010,TOYOT,SIENNA,SPORTV,5TDDK4CC2AS032360,77 SUNNYSLOPE D,7,UNNYS

In [53]:
def replace_address(line):
    if line['Zip'].isnumeric():
        return line['Street Address']
    else:
        return line['Town/State/Zip']

df['Street Address'] = df.apply(replace_address, axis=1)

In [60]:
df.loc[df['Street Address'] == df['Town/State/Zip'], 'City'] = ''
df.loc[df['Street Address'] == df['Town/State/Zip'], 'State'] = ''
df.loc[df['Street Address'] == df['Town/State/Zip'], 'Zip'] = ''
df.loc[df['Street Address'] == df['Town/State/Zip'], 'Town/State/Zip'] = ''

In [61]:
df

,Name,Street Address,Town/State/Zip,Class,Year,Make,Model,Body,VIN,City,State,Zip
0,18FORE18 INC,201 PATTONWOOD DR,"SOUTHINGTON, CT 06489-1632",11,2002,USCAR,USCL58SA,TRAILE,4X4TSE0112X053369,SOUTHINGTON,CT,06489
1,3 BROTHERS PROPERTY PRESERVATION SE,461C COOKE ST,"FARMINGTON, CT 06032",3,2013,FORD,F350 SUP,PICKUP,1FTRF3B68DEA53496,FARMINGTON,CT,06032
2,A & A SURPLUS INC.,389 MARION AVE,"PLANTSVILLE, CT 06479",3,2008,TOYOT,TUNDRA D,CREWPI,5TBBV54198S491700,PLANTSVILLE,CT,06479
3,A & A SURPLUS INC.,389 MARION AVE,"PLANTSVILLE, CT 06479",2,2012,FREIG,M2 106 M,FLAT-B,1FVACXDT5CHBV1762,PLANTSVILLE,CT,06479
4,A AND A SURPLUS INC,389 MARION AVE,"PLANTSVILLE, CT 06479-1403",2,1999,INTER,4000 SER,CONVEN,1HTSCAAM3XH688887,PLANTSVILLE,CT,06479
...,...,...,...,...,...,...,...,...,...,...,...,...
42991,ZZIP ELECTRIC INC,350 DUNHAM ST,"SOUTHINGTON, CT 06489-1215",10,2014,BELMO,SSTD2214,TRAILE,1B9TD2225EL657496,SOUTHINGTON,CT,06489
42992,ZZIP ELECTRIC INC,350 DUNHAM STREET,"SOUTHINGTON, CT 06489",2,1997,CHEVR,G3500,CUTAWA,1GBHG31R6V1003858,SOUTHINGTON,CT,06489
42993,ZZIP ELECTRIC INC,350 DUNHAM STREET,"SOUTHINGTON, CT 06489",2,2011,GMC,SIERRA K,CREWCH,1GD422CLXBF157043,SOUTHINGTON,CT,06489
42994,ZZIP ELECTRIC INC,350 DUNHAM ST,"SOUTHINGTON, CT 06489-1215",3,2015,GMC,SAVANA G,CARGOV,1GTW7FCF3F1903772,SOUTHINGTON,CT,06489
42995,ZZIP ELECTRIC INC,350 DUNHAM STREET,"SOUTHINGTON, CT 06489",10,2020,CAM,7CAM616L,DUMP,5JWCA1628LP506187,SOUTHINGTON,CT,06489

In [62]:
df.State.unique()

array(['CT', 'PA', '', 'TX', 'AL', 'NJ', 'RI', 'GA', 'OH', 'IL', 'MA',
       'OT', 'SD', 'MD', 'NC', 'VA', 'TE', 'MO', 'FL', 'MN', 'CA', 'ME',
       'SC', 'UT', 'PT', 'NH', 'NY', 'MI', 'AZ', 'WI'], dtype=object)

In [64]:
df = df.drop(columns=['Town/State/Zip'])
df.to_excel(sav_path + f)

# todo